# Accessing MongoDb using Pymongo


Python package accessing MongoDb on localhost.

MongoDB is an unstructured database. It stores data in the form of documents. MongoDB is able to handle huge volumes of data very efficiently and is the most widely used NoSQL database as it offers rich query language and flexible and fast access to data.

In [1]:
#install package 
#!pip install pymongo

In [2]:
# import libraries
import pymongo 
import pprint
import pandas as pd
from bson.objectid import ObjectId

In [3]:
#connecting to local host
mongo_uri = "mongodb://localhost:27017/"  
client = pymongo.MongoClient(mongo_uri)

In [4]:
#check available databases 
client.list_database_names()

['admin', 'config', 'game-of-thrones', 'local']

In [5]:
#accessing game-of-thrones db
db=client['game-of-thrones']

In [6]:
#The list_collection_names command shows the names of all the available collections:
db.list_collection_names()

['characters']

In [7]:
#count the number of document 
table=db['characters']
table.count_documents({})

7

## Creating a dataframe using pandas

In [8]:
# transfering to dataframe
sample=table.find()

In [9]:
df=pd.DataFrame(sample)

In [10]:
df.head()

,_id,name,username,address,birthdate,email,accounts,tier_and_details,active
0,5e8bfaa25d20d53b2431e841,Jon Snow,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5e8bfb265d20d53b2431e843,Arya Stark,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,5ca4bbcea2dd94ee58162c5e,Brandon Contreras,ecasey,"6942 Connie Skyway\nPatrickville, WA 16551",1973-10-23 23:52:10,amber97@hotmail.com,"[896364, 450464]",{'f4cebafe5530421b991303dff297643d': {'tier': ...,NaN
3,5e8c25725d20d53b2431e844,testing,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,new,newAlan,new,Somewhere in Singapore,NaN,NaN,NaN,NaN,NaN

## Inserting Data

In [11]:
#inserting one 
post = {
        'username': 'new123', 
        'name':'newAlan', 
        'address':'Somewhere in Singapore'}
        
post_id = table.insert_one(post).inserted_id
post_id

ObjectId('5e8c2ebc6057435b48b52885')

In [12]:
# inserting many functions
import datetime
new_posts = [{"name": "newMike",
            "username": "latestpost!",
            "date": datetime.datetime(2009, 11, 12, 11, 14)},
            {"name": "Eliot",
            "title": "onceAgain",
            "text": "and pretty easy too!",
            "date": datetime.datetime(2009, 11, 10, 10, 45)}]

final = table.insert_many(new_posts)

final.inserted_ids

[ObjectId('5e8c2ebc6057435b48b52886'), ObjectId('5e8c2ebc6057435b48b52887')]

## Sorting the table and printing in DataFrame

In [13]:
new=table.find().sort("name",pymongo.DESCENDING)

In [14]:
new_df=pd.DataFrame(new)

In [15]:
new_df

,_id,name,username,date,address,title,text,birthdate,email,accounts,tier_and_details,active
0,5e8c25725d20d53b2431e844,testing,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5e8c2ebc6057435b48b52886,newMike,latestpost!,2009-11-12 11:14:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,new,newAlan,new,NaT,Somewhere in Singapore,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,new123,newAlan,new123,NaT,Somewhere in Singapore,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5e8c2d784547f2264e8753f6,newAlan,new123,NaT,Somewhere in Singapore,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,5e8c2ebc6057435b48b52885,newAlan,new123,NaT,Somewhere in Singapore,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,5e8bfaa25d20d53b2431e841,Jon Snow,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,5e8c2ebc6057435b48b52887,Eliot,NaN,2009-11-10 10:45:00,NaN,onceAgain,and pretty easy too!,NaN,NaN,NaN,NaN,NaN
8,5ca4bbcea2dd94ee58162c5e,Brandon Contreras,ecasey,NaT,"6942 Connie Skyway\nPatrickville, WA 16551",NaN,NaN,1973-10-23 23:52:10,amber97@hotmail.com,"[896364, 450464]",{'f4cebafe5530421b991303dff297643d': {'tier': ...,NaN
9,5e8bfb265d20d53b2431e843,Arya Stark,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Filtering Condition

In [16]:
table.find_one({"name":'Alan'})

In [17]:
#
post_id=final.inserted_ids[1]
def parser(post_id):
    document = table.find_one({'_id': ObjectId(post_id)})
    return document

parser(post_id)

{'_id': ObjectId('5e8c2ebc6057435b48b52887'),
 'name': 'Eliot',
 'title': 'onceAgain',
 'text': 'and pretty easy too!',
 'date': datetime.datetime(2009, 11, 10, 10, 45)}

## Deletion of row

In [18]:
table.find_one({'name':'Alan'})

In [19]:
table.delete_one({"name":"Alan"})

In [20]:
##multiple deletion
myquery = ({ "name":{"$in": ["newMike","Eliot"]}})
x = table.delete_many(myquery)

print(x.deleted_count, " documents deleted.")

2  documents deleted.

## Loading csv into MongoDb
1. Create the Database
2. Create the table
3. Append them into table using pandas

In [21]:
#create the database
mydb=client['sample']

In [22]:
#create sample table
mytable=mydb['table']

In [23]:
#need to insert a document to create the database
testInsert=mytable.insert_one({"country":'India'}).inserted_id

In [24]:
#delete
mytable.delete_one({"country":'India'})

In [25]:
df=pd.read_csv('sampleMongoData.csv') #provide file location
listofDocs=[]
for i in df.index:
    listofDocs.append(dict(df.iloc[i]))

myfinal = mytable.insert_many(listofDocs)
mytable.count_documents({})

500

In [26]:
view=mytable.find()
df_view=pd.DataFrame(view)
df_view.head()

,_id,username,name,address,birthdate,email,accounts,tier_and_details,active
0,5ca4bbcea2dd94ee58162c5e,ecasey,Brandon Contreras,"6942 Connie Skyway\nPatrickville, WA 16551",1973-10-23 23:52:10,amber97@hotmail.com,"[896364, 450464]",{'f4cebafe5530421b991303dff297643d': {'tier': ...,NaN
1,5ca4bbcea2dd94ee58162c5d,qknight,Gabriel Romero,"79375 David Neck\nWest Matthewton, NJ 92863",1971-05-04 21:20:10,erica98@gmail.com,"[568852, 351063, 635650, 229182, 732327, 89698]",{},NaN
2,5ca4bbcea2dd94ee58162c5c,smcintyre,Christopher Lawrence,"00881 West Flat\nNorth Emily, IL 32130",1997-03-05 18:20:57,vkeith@yahoo.com,"[551774, 264502, 599670, 193228, 397774]",{},NaN
3,5ca4bbcea2dd94ee58162c5b,stricklandjeffery,Xavier Myers,"499 Jonathan Streets Apt. 890\nEast Ashley, MD...",1987-10-24 19:05:15,fredsmith@yahoo.com,"[285957, 875868, 138703, 122908, 370468]",{},NaN
4,5ca4bbcea2dd94ee58162c5a,amandawilliams,Brandy Huang,"9505 Melissa Streets\nSouth Frankville, NJ 91189",1975-09-22 14:21:58,scottjonathan@yahoo.com,"[650729, 991663, 144876, 912504, 88163]",{},NaN

# References: 

- https://zellwk.com/blog/install-mongodb/
- https://www.analyticsvidhya.com/blog/2020/02/mongodb-in-python-tutorial-for-beginners-using-pymongo/